[
  {
    "date": "January 1",
    "dateTemporal": "2023-01-01",
    "lead": "Nathan",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John/Rommel",
    "topic": "COMMUNION SUNDAY/ FCC THEME FOR THE YEAR - KOINONIA SERIES - Building A Healthy Relevant Church",
    "title": "What is Koinonia?",
    "scripture": " Acts 2:42-47, Hebrews 10:25, John 13:34-35, Proverbs 27:17",
    "objective": "To challenge the congregation to develop deeper relationships within the church and in effect enhance their own personal relationship with God.",
    "summary": "People need love and need to be cared for and the church ought to be a place where the deepest love and the deepest caring for each other is real. The church is meant to be a place where we experience in depth relationships and life long friendships are developed.",
    "speaker": "ROLAND YUMUL"
  },
  {
    "date": "January 8",
    "dateTemporal": "2023-01-08",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "KOINONIA SERIES 2 - Building A Powerful, Spirit-Led Church",
    "title": "When Is Fellowship, Fellowship? ",
    "scripture": "Acts 2:42, Ephesians 3:9, Ephesians 5:4, Galatians 2:9, Philippians 1:5, Philippians 2:1",
    "objective": "To explore more the meaning of the Greek work koinonia, using many examples from the Scripture.",
    "summary": "Is a fellowship supper, fellowship? Or is it deeper than that? But without the fellowship of the Spirit bathing everything with purpose, God’s purpose, can we really say we’ve even been to church? This message will dig deeper in what koinonia truly means.",
    "speaker": "STEVE MIRPURI"
  },
  {
    "date": "January 15",
    "dateTemporal": "2023-01-15",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "KOINONIA SERIES  3 - Building A Worshipful, Faithful Church",
    "title": "The Koinonia of Worship",
    "scripture": "1 Corinthians 10:16-17, 1 Corinthians 12:7-11, 1 John, 1 John 1:3, 1 Samuel, Acts 13, Ephesians 5:17-19, Exodus 33:14-18, Psalms 22:3",
    "objective": "To pursue God's presence during a worship service. New Testament Christianity calls for our participation. We must be careful our \"worship\" service doesn't become a performance with an audience. We want everyone engaging in worship.",
    "summary": "A more holistic understanding is that we come to commune with the Lord. We come to enjoy koinonia with the Father and the Son by the Holy Spirit. Koinonia is not just a one-way exchange. It is interaction with one another and with the Lord.'",
    "speaker": "BERNARD BERSAMIN"
  },
  {
    "date": "January 22",
    "dateTemporal": "2023-01-22",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "KOINONIA SERIES 4 - Building A Mindful, Kind Church",
    "title": "Digital Koinonia - Does It Exist?",
    "scripture": "Acts 2:42-47, Ecclesiastes 4:9-12, Ephesians 4:2, Galatians 2:9, Galatians 5:13, Hebrews 10:24,13:15-16, James 5:16, John 13:34, Matthew 24:30-31, Philippians 2:4, Revelation 21:2-3, Revelation 7:9-10, Romans 12:10,12:16,15:7",
    "objective": "To to explain the digital koinonia concept and the reasons behind its presence contemporarily, including its characteristics following the logic of media and the internet is a new epistemology demanding theological reconstruction.",
    "summary": "Koinonia is a concept explaining communion or fellowship in the theology of Christian. After the era of the Internet of Things, the communion pattern has shifted from a direct relationship involving physical presence to an indirect relationship where the internet and all of its products exist among humans. Therefore, it is necessary to build a new conception of digital koinonia. ",
    "speaker": "ISAAC MELIS"
  },
  {
    "date": "January 29",
    "dateTemporal": "2023-01-29",
    "lead": "John",
    "guitar": "John",
    "keys": "Noreen",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "Nathan",
    "topic": "KOINONIA SERIES 5 - Building a Purpose-Driven, Christ-Minded Church",
    "title": "Consumer or Producer?",
    "scripture": "James 1:22-25, John 15:1-7, John 15:1-8, Revelation 2:4-5, Revelation 2:9-10",
    "objective": "The sermon will answer these two questions:  If you’re not a producer where you are, what evidence is there that you’ll produce somewhere else? And if there is no evidence of fruit, are we even producers? ",
    "summary": "When it comes down to the Jesus are you a producer or a consumer? Many churches today are not producing producers. They’re producing consumers. People who want to be entertained, not trained. They want to be hearers, not doers. They look at church as a social outing rather than a place to learn and grow in Jesus.",
    "speaker": "BENJAMIN PANTOJA"
  },
  {
    "date": "February 5",
    "dateTemporal": "2023-02-05",
    "lead": "Raquel",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "James",
    "backup": "Noreen",
    "av": "John",
    "topic": "COMMUNION SUNDAY/ LOVE MONTH \nKOINONIA SERIES  6 - The Problem with \"Over\"-Fellowship",
    "title": "Loser or Winner?",
    "scripture": "Acts 1:1-2:41, Acts 1:8, Acts 2:1-4, Acts 2:17, Acts 2:38-39, Acts 2:41, Acts 2:43, Acts 2:5-6",
    "objective": "To emphasize that we are \"losers\" if the church is not aware of the power of the Holy Spirit.  Understanding who the Holy Spirit is and being empowered by the Holy Spirit are crucial to living a life of discipleship, witness, mission, and service.",
    "summary": "While we call it the “Acts of the Apostles” it would be more accurate to call it the “Acts of the Holy Spirit” as it was the Holy Spirit moving through, in, and by the Apostles that allowed the church to move in power. The exact same thing is true for us today – we have the same Holy Spirit they had; we have the same power available; the same vision, and the same message.",
    "speaker": "STRING LA GUARDIA"
  },
  {
    "date": "February 12",
    "dateTemporal": "2023-02-12",
    "lead": "James",
    "guitar": "Ian",
    "keys": "Joi",
    "bass": "Nathan",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "John",
    "topic": "VALENTINE SUNDAY - KOINONIA SERIES 7 - The Problem with Losers",
    "title": "Club or Church?",
    "scripture": "1 Thessalonians 2:17-3:13, Acts 17, Acts 17:4-5, Galatians 6:9-10",
    "objective": "The sermon will answer these questions: Why choose the church? What is it about the fellowship of the church that makes it stand out above all the others out there? ",
    "summary": "When you are involved in a club you have financial obligations and responsibilities, the same could be said about the church. So, what's the difference? Jesus gave His life not just to save us as individuals but also to make us a part of His body. ",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "February 19",
    "dateTemporal": "2023-02-19",
    "lead": "Pre-teens",
    "guitar": "Pre-teens",
    "keys": "Pre-teens",
    "bass": "Pre-teens",
    "drums": "Pre-teens",
    "backup": "Pre-teens",
    "av": "John/Nathan",
    "topic": "FAMILY DAY WEEKEND\nKOINONIA SERIES 8 - The Problem with Church Splits",
    "title": "Division or Multiplication?",
    "scripture": "Romans 14:19-22, Romans 15, Romans 15:5-7, Romans 16:17-18",
    "objective": "To remind the church that unity of Spirit is important. It is powerful enough to stop division, empower a church and hold believers on task. Taking our eyes off of Christ is a sure fire way to invite division, discord and eventually demise.",
    "summary": "As churches break up, as they stop growing, as people leave and others get disgusted, the issues are not usually even important or serious. Who benefits by division exisiting in the church? Is God honored and glorified by divisiveness?\n\n",
    "speaker": "FERDINAND FERNANDO"
  },
  {
    "date": "February 26",
    "dateTemporal": "2023-02-26",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "James",
    "backup": "Raquel",
    "av": "John",
    "topic": "KOINONIA SERIES 9  - The Problem with Giving",
    "title": "To Tithe or Not to Tithe: That is the Question",
    "scripture": "Acts 20:35, Galatians 3:7, 14:18-20, 28:22, 4:4-5, Hebrews 7:8-9, John 8:39, Leviticus 27:30, Malachi 3:10-12, Matthew 23:23, 28:19,  6:19-21, Matthew 6:33, Proverbs 3:9",
    "objective": "To emphasize the importance, the relevance, and the necessity of tithing.",
    "summary": "There are many Christians today who do not practice tithing because they believe tithing was established under the Old Covenant law and is not applicable today. They say that they are no longer under law and believe that grace has done away with tithing. Should we still tithe today?",
    "speaker": "RAPHAEL LEVI ARNAN"
  },
  {
    "date": "March 5",
    "dateTemporal": "2023-03-05",
    "lead": "John",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": "COMMUNION SUNDAY/ \nHOT POTATOES SERIES 1 - About Godly Parenting",
    "title": "Mold and Mentor",
    "scripture": "Ephesians 4, Ephesians 5, Ephesians 6:1-4, Hebrews 11, Hebrews 11:6",
    "objective": "To remind parents that the most important lesson they will teach their children is to learn biblical submission through the process of teaching them to obey. It is the primary spiritual lesson and foundation of parenting.",
    "summary": "Intentionally parenting means we need to raise our kids under a purpose and a plan. Raising godly children is one of the great challenges of Christian parenting, but it's also a great privilege. Knowing how to raise children to love and serve God and obey their parents and others in authority is not automatic. It's a matter of faithfully applying biblical parenting principles.",
    "speaker": "ORPAH MARASIGAN"
  },
  {
    "date": "March 12",
    "dateTemporal": "2023-03-12",
    "lead": "FCC Women",
    "guitar": "FCC Women",
    "keys": "FCC Women",
    "bass": "FCC Women",
    "drums": "FCC Women",
    "backup": "FCC Women",
    "av": "John/Nathan",
    "topic": "DST BEGINS/ INTL WOMEN’S DAY\nWomen’s Sunday\nHOT POTATOES SERIES 2 - About Drinking",
    "title": "Drunk and Disillusioned",
    "scripture": "Matthew 11:19, Matthew 9:17, Romans 14:21, Titus 1:7, Titus 1:7",
    "objective": "To answer the following questions:  \"Is it acceptable for a Christian to drink wine, (or other alcoholic beverages) at all?  \nDoes the scripture teach abstinence? Does it teach that it is ok?\"",
    "summary": "Abstinence is not taught in the Bible, but neither is drunkenness. If you choose to drink moderation is the key. If fact moderation is the key for many things we do in life. But before you do drink remember this passage, from 1 Cor. 10:31; \"Therefore, whether you eat or drink, or whatever you do, do all to the glory of God.\"",
    "speaker": "KIT CABULLO"
  },
  {
    "date": "March 19",
    "dateTemporal": "2023-03-19",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": "HOT POTATOES SERIES  3-  About Sin and Temptation",
    "title": "Flee and Fight",
    "scripture": "1 Timothy 6:11-12",
    "objective": "To remind the church that the Christian must flee from sin and temptation, follow after righteousness and fight the good fight of the faith.",
    "summary": "The Christian is like a fugitive. He has an enemy who goes around like a roaring lion seeking to devour him. He has goals to pursue. He has a battle to fight. Our text calls upon us to flee, follow, and fight.\nThe Apostle Paul is writing to a young preacher, Timothy, giving him advice on living the Christian life. This is a very succinct statement of the Christian’s obligations. ",
    "speaker": "PROVIDENCE CARSOLA"
  },
  {
    "date": "March 26",
    "dateTemporal": "2023-03-26",
    "lead": "Joi",
    "guitar": "Ian",
    "keys": "Joi",
    "bass": "Nathan",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "John",
    "topic": "POST-SERVICE LEADERS’ QUARTERLY REPORT\nHOT POTATOES SERIES 4 - About Abortion",
    "title": "Formed and Fulfilled",
    "scripture": "Genesis 2:7, Luke 1:15, Luke 1:41, Luke 2:16, Psalm 100, Psalm 139, Psalms 100:1-5",
    "objective": "To dig deep on the sanctity of human life and issues surrounding abortion.",
    "summary": "There are many serious questions relating to the abortion issue. Is the unborn baby a human being? Is the unborn a person? Is the unborn a soul? Is it wrong to terminate the life of an unborn child? These and other pertinent questions relating to abortion are explicitly addressed in the Word of God.",
    "speaker": "ERWIN AMADOR"
  },
  {
    "date": "April 2",
    "dateTemporal": "2023-04-02",
    "lead": "Raquel",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Miguel",
    "backup": "James",
    "av": "John/Nathan",
    "topic": "COMMUNION SUNDAY/PALM SUNDAY/ CHURCH ANNIVERSARY",
    "title": "Hosanna in the Highest",
    "scripture": "John 12:12-36",
    "objective": "To preach on the importance of Palm Sunday as told by Apostle John",
    "summary": "Today is the day that the historical triumphal entrance of Jesus Christ into Jerusalem is celebrated. And today is the day that marks the beginning of the last week of our Lord here on earth.",
    "speaker": "STRING LA GUARDIA"
  },
  {
    "date": "April 7",
    "dateTemporal": "2023-04-07",
    "lead": "?",
    "guitar": "?",
    "keys": "?",
    "bass": "?",
    "drums": "?",
    "backup": "?",
    "av": "?",
    "topic": "GOOD FRIDAY/ WASHING OF FEET",
    "title": "Seven Last Words of Jesus",
    "scripture": "John 19:26, John 19:26-30, John 19:28, John 19:30, Luke 23:24, Luke 23:24-46, Luke 23:43, Luke 23:46, Matthew 27:46, Psalms 2:2-8",
    "objective": "Exhort about the seven last statements of our Lord Jesus Christ.",
    "summary": "These words reflect a true understanding of God and mankind. With such understanding Jesus responded confidently on the cross.  Jesus went to the Cross so that we, through his death and resurrection might have a personal relationship with God and that we might know its power in every area of our lives.",
    "speaker": "ROLAND YUMUL\nERROL RASCO\nELDER 1\nELDER 2\nIAN IRONG\nYMUZ CRUZ\nNOREEN LARDIZABAL"
  },
  {
    "date": "April 9",
    "dateTemporal": "2023-04-09",
    "lead": "James",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John/Nathan",
    "topic": "EASTER SUNDAY",
    "title": "The Joy of Easter",
    "scripture": "1 Corinthians 15:12-15\nLuke 24:1-12",
    "objective": "To remind our congregation that we rejoice in our risen Savior because he has given us living hope. That living hope is ours because our risen Savior has worked genuine faith in our hearts.",
    "summary": "Our purpose is to share our Easter joy all the time in every opportunity – not just inviting people to a special community outdoor service – but bringing them to see the hands of their risen, loving Savior who gives them living hope year round that lasts for all eternity!",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "April 16",
    "dateTemporal": "2023-04-16",
    "lead": "John",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "James",
    "backup": "Frances",
    "av": "Nathan",
    "topic": "TEACHING SERIES 1\nChurch Leadership",
    "title": "Follow the Leader",
    "scripture": "1 Timothy 3:8-13, Acts 6:1-6, Acts 6:2, Acts 6:2-5, Mark 10:42-45",
    "objective": "To define servant leadership with practical application within church setting.",
    "summary": "Character and spirituality are the essential indicators in the selection of church leaders. They are to lead through their service to God, His ministers, and His local church.  (Include description of elders and deacons.)",
    "speaker": "NOEL PANTOJA"
  },
  {
    "date": "April 23",
    "dateTemporal": "2023-04-23",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Noreen",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "Nathan",
    "topic": "TEACHING SERIES 2\nCreation",
    "title": "Creation or Chance?",
    "scripture": "Genesis 1:1-2:3",
    "objective": "To answer the question: What was the purpose of creation? Include issues like evolution (micro and macro) as well as young earth vs. old earth.",
    "summary": "So, creation or evolution. Does it really matter? Isn’t it all just a non-issue? Is the Bible simply out of date? For many people, whether we descend from an ape or from Adam means nothing at all. But for others it means a great deal because if the Bible can be proved wrong at one point then what else could be wrong? How much of the Bible can we really believe? Isn’t it all just a lot of stories?",
    "speaker": "GREG ROASA"
  },
  {
    "date": "April 30",
    "dateTemporal": "2023-04-30",
    "lead": "Pre-teens",
    "guitar": "Pre-teens",
    "keys": "Pre-teens",
    "bass": "Pre-teens",
    "drums": "Pre-teens",
    "backup": "Pre-teens",
    "av": "John/Nathan",
    "topic": "EARTH DAY\nTEACHING SERIES 3\nKnowing our Enemy - Satan",
    "title": "Know Your Enemy",
    "scripture": "Peter, Colossians 1:16, Ephesians 6, Ezekiel 28, John 1:1-3, John 12:31, Luke 4, Matthew 4:1-11",
    "objective": "To answer the questions:  What does the Bible say about Satan? Where did he come from, what is he up to and why did God allow him in the scene anyway? Can he make us do things? What are his limitations? Why do we need to know our Enemy?",
    "summary": "The world believing that Satan may not be a real person, but some sort of mythical figure or fiction character that only ‘represents’ the evil influence in the world. But, as believers, we must know and realize that the Bible clearly describes the devil and carefully outlines his strategy for derailing all Christians and their witness.",
    "speaker": "STEVE MIRPURI"
  },
  {
    "date": "May 7",
    "dateTemporal": "2023-05-07",
    "lead": "James",
    "guitar": "Nathan",
    "keys": "Noreen",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "John",
    "topic": "COMMUNION SUNDAY\nTEACHING SERIES 4\nTrinity",
    "title": "God in Three Persons",
    "scripture": "Hebrews 4:15, John 1:1-14, John 14:25-26, John 14:9, John 16:12-15, John 20:28, Luke 3:21",
    "objective": "To answer the questions:  Why is the doctrine of the Trinity so important to our understanding of salvation?  Do Christians believe in one God or Three Gods, as monotheistic groups claim?",
    "summary": "The Bible does not spell out “Trinity.” The idea of the Trinity is so ingrained in Christianity that it is nowhere described, but assumed in Scripture. The word Trinity doesn’t appear as a theological term till near the end of the second century. “It was first used as ‘Trias’ by Theophilus, the Bishop of Antioch in AD. 180 and later by Tertullian asTrinitas to signify that God exists in three persons.” This sermon will explore the doctrine of the triune God.",
    "speaker": "RAPHAEL LEVI ARNAN"
  },
  {
    "date": "May 14",
    "dateTemporal": "2023-05-14",
    "lead": "FCC Men",
    "guitar": "FCC Men",
    "keys": "FCC Men",
    "bass": "FCC Men",
    "drums": "FCC Men",
    "backup": "FCC Men",
    "av": "John/Nathan",
    "topic": "MOTHER’S DAY SERVICE\n",
    "title": "Raising Eagles",
    "scripture": "1 Samuel 1:1-2:2",
    "objective": "To use Hannah as an example of being a godly mother.",
    "summary": "There is no other job in the world that is as heart-breaking, or as rewarding, as motherhood. No other job, will have the influence, or the impact on the world, like parenting does. 90% of teenagers, when asked who influences them most, still say their parents. That influence can be a godly one, or a worldly one. ",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "May 21",
    "dateTemporal": "2023-05-21",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John/Nathan",
    "topic": "VICTORIA DAY WEEKEND\nTEACHING SERIES 5\nForgiveness",
    "title": "Let It Go",
    "scripture": "Colossians 3:1-18, Colossians 3:1-3:18, Isaiah 55:7, Luke 6:37, Psalm 130",
    "objective": "To remind the church that forgiveness is the way the Lord releases us from guilt and sets us free to continue loving God and others.",
    "summary": "We want forgiveness from God, and he offers it freely every time we ask Him- and He expects us to forgive others so that we are not imprisoned by words, actions, situations beyond our control, things that destroys our lives and our relationship with God.",
    "speaker": "ZAK LALIC"
  },
  {
    "date": "May 28",
    "dateTemporal": "2023-05-28",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "James",
    "backup": "Frances",
    "av": "John/Nathan",
    "topic": "TEACHING SERIES 6\nSanctification",
    "title": "Understanding Sanctification",
    "scripture": "Acts 15:8-9, Galatians 2:20, I Thessalonians, Luke 11:13, Romans 12:1-2",
    "objective": "To answer the questions: how do we ever get to the place of entire sanctification? What's the difference between positional and progressive sanctification?",
    "summary": "A breif sermon on sanctification. Justification is the work of God FOR us Sanctification is the work of God IN us Regeneration the impartation of a new Nature Sanctification in the destruction of the Old Nature.  We, as believers are separated from the world unto God, and hence are called saints or sanctified ones.",
    "speaker": "KIT CABULLO"
  },
  {
    "date": "June 4",
    "dateTemporal": "2023-06-04",
    "lead": "John",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Nathan",
    "drums": "Miguel",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": "COMMUNION SUNDAY/ C&MA SUNDAY SERVICE",
    "title": "A Missionary Report",
    "scripture": "John 18:36, Matthew 28:18-20",
    "objective": "An Alliance missionary will be invited to report about his mission work."
  },
  {
    "date": "June 11",
    "dateTemporal": "2023-06-11",
    "lead": "James",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John/Nathan",
    "topic": "PHILIPPINE Independence SUNDAY",
    "title": "Praying for the Philippines",
    "objective": "A report on the spiritual situation in the Philippines.",
    "speaker": "MIKKO ARDINA"
  },
  {
    "date": "June 18",
    "dateTemporal": "2023-06-18",
    "lead": "FCC Women (Joi)",
    "guitar": "FCC Women",
    "keys": "FCC Women",
    "bass": "FCC Women",
    "drums": "FCC Women",
    "backup": "FCC Women",
    "av": "John/Nathan",
    "topic": "FATHER’S DAY SERVICE",
    "title": "The Legacy of our Fathers",
    "scripture": "1 Corinthians 16:13, Colossians 3:18-20, 1 Thessalonians 2:10-12",
    "objective": "To encourage the fathers to leave a lasting, spiritual legacy for their children.",
    "summary": "The message Paul gave to the Church in Corinthia is the same message he would give to the modern day Church, to the men of the Church- be watchful of demonic attacks, stand fast like Christians in a fallen world, behave like men at all times and be strong always.",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "June 25",
    "dateTemporal": "2023-06-25",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Miguel",
    "backup": "James",
    "av": "John/Nathan",
    "topic": "GRADS DAY/ \nPOST-SERVICE LEADERS’ QUARTERLY REPORT",
    "title": "The School of Life",
    "scripture": "Psalm 73, Psalms 50, Psalms 73:1-28, Revelation 3:21, Nehemiah 12:46",
    "objective": "To encourage and inspire the graduates.  To follow the educational journey of Asaph through Psalm 73 and discover the teaching that changes character and destiny.",
    "summary": "To focus on Psalm 73 for a message that reveals a spiritual educational experience of Asaph in the school of life.  et’s track Asaph’s journey as he discovers the surprising joy of a radical reinterpretation of what is good.",
    "speaker": "PROVIDENCE CARSOLA"
  },
  {
    "date": "July 2",
    "dateTemporal": "2023-07-02",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "James",
    "backup": "Frances",
    "av": "John/Nathan",
    "topic": "COMMUNION SUNDAY/ CANADA DAY WEEKEND \n SPIRITUAL DISCIPLINES SERIES 1\n",
    "title": "What's the big deal about baptism?",
    "scripture": "Luke 23:43, Mark 16:16, Matthew 28:19, Matthew 3:13-15, Romans 6:3-4, Romans 6:4, Romans 6:6-7, Titus 3:4, Titus 3:5",
    "objective": "To address the elements of baptism as well as why baptism is important.  \n",
    "summary": "Baptism is significant in that it represents the forgiveness and cleansing from sin that comes through faith in the Lord Jesus Christ. ",
    "speaker": "BENJAMIN PANTOJA"
  },
  {
    "date": "July 9",
    "dateTemporal": "2023-07-09",
    "lead": "Pre-teens",
    "guitar": "Pre-teens",
    "keys": "Pre-teens",
    "bass": "Pre-teens",
    "drums": "Pre-teens",
    "backup": "Pre-teens",
    "av": "John/Nathan",
    "topic": "CAMPING\n SPIRITUAL DISCIPLINES SERIES 2",
    "title": "What's the big deal about quiet time?",
    "scripture": "Mark 1:35-39, Daniel 6:1-28, Exodus 19:1-8",
    "objective": "To show why and how to have a meaningful Quiet Time or alone time with the Lord",
    "summary": "Christianity is all about a relationship with our Creator and one way of enhancing the relationship is through Quiet Time or personal devotion. If we are faithful to this age-long practice we will have a deeper and closer walk with God.",
    "speaker": "ISAAC MELIS"
  },
  {
    "date": "July 16",
    "dateTemporal": "2023-07-16",
    "lead": "James",
    "guitar": "Ian",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Nathan",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": " SPIRITUAL DISCIPLINES SERIES 3",
    "title": "What's the big deal about servanthood?",
    "scripture": "James 4:6-7, Acts 20:13-38, Galatians 4:1-9, John 1:40-42",
    "objective": "To encourage everyone to find their place to serve in the church and in the community. The Bible talks about us as being servants of God. But it also says we are Sons of the living God. How can we be both? And what does that mean to us as live our Christian life?",
    "summary": "In Christ, as opposed to the world, the servant is greatest of all. Yet in most churches, it is the least of all gifts utilized. The attitude of servanthood made the New Testament church unique. Being a servant is necessary for the believer and for Christian leadership.",
    "speaker": "RICHARD ROJAS"
  },
  {
    "date": "July 23",
    "dateTemporal": "2023-07-23",
    "lead": "Raquel",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "James",
    "backup": "Frances",
    "av": "John",
    "topic": "SPIRITUAL DISCIPLINES SERIES 4",
    "title": "What's the big deal about purity?",
    "scripture": "1 Thessalonians 4:3-8, Ephesians 5:1-3, Genesis 3, Hebrews 13:4, Leviticus 18, Mark 10, Matthew 19, Matthew 5, Proverbs 5:15-20, Romans 1:24",
    "objective": "To study the many verses that describe God's call for the purity of his people. We seek to understand the call and live it.",
    "summary": "God expects us to be holy – separated from anything that defiles. We’re to be like Him. We need pure minds, hands, and hearts. Nothing will steal the joy of your Christianity like struggling with your purity.\n\n",
    "speaker": "GREG ROASA"
  },
  {
    "date": "July 30",
    "dateTemporal": "2023-07-30",
    "lead": "?",
    "guitar": "?",
    "keys": "?",
    "bass": "?",
    "drums": "?",
    "backup": "?",
    "av": "?",
    "topic": "SPIRITUAL DISCIPLINES SERIES 5",
    "title": "What's the big deal about discipleship?",
    "scripture": "James 3:13, Luke 14:25-33, Luke 14:25-35, Luke 5:1-11",
    "objective": "To answer the questions:  what does it mean to be a disciple of Christ? What does that look like? What does discipleship have to do with the church?",
    "summary": "We are called to be disciples of Jesus Christ. A true disciple displays various traits and qualities that reflect the love and grace of Jesus Christ. We need to help people to better know the awesome power and intimacy of God’s love, and that will radically change their hearts and lives.",
    "speaker": "DAN DEGARIS"
  },
  {
    "date": "August 6",
    "dateTemporal": "2023-08-06",
    "lead": "Joi",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "James",
    "av": "John",
    "topic": "COMMUNION SUNDAY/ CIVIC HOLIDAY WEEKEND - EVANGELISM SERIES 1",
    "title": "P2C",
    "objective": "To share the evangelistic methods and tools used by CCC/Cru/P2C. (The Four Spiritual Laws)",
    "speaker": "EFI FERMIN"
  },
  {
    "date": "August 13",
    "dateTemporal": "2023-08-13",
    "lead": "John",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "James",
    "backup": "Frances",
    "av": "John/Nathan",
    "topic": "FCC PICNIC\nEVANGELISM SERIES 2",
    "title": "PSALM",
    "objective": "To share the evangelistic methods and tools used by the PSALM. (Fishers of Men)",
    "speaker": "CHRISTER TAJOS LUCHAVEZ"
  },
  {
    "date": "August 20",
    "dateTemporal": "2023-08-20",
    "lead": "James",
    "guitar": "Nathan",
    "keys": "Sarah",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": "EVANGELISM SERIES 3",
    "title": "IVCF",
    "objective": "To share the evangelistic methods and tools used by IVCF. (The New Believer Witness)"
  },
  {
    "date": "August 27",
    "dateTemporal": "2023-08-27",
    "lead": "FCC Men",
    "guitar": "FCC Men",
    "keys": "FCC Men",
    "bass": "FCC Men",
    "drums": "FCC Men",
    "backup": "FCC Men",
    "av": "John/Nathan",
    "topic": "INTERNATIONAL YOUTH DAY\nEVANGELISM SERIES 4",
    "title": "NAVIGATORS",
    "objective": "To share the evangelistic methods and tools used by the Navigators. (The Bridge to Life)"
  },
  {
    "date": "September 3",
    "dateTemporal": "2023-09-03",
    "lead": "John",
    "guitar": "John",
    "keys": "Noreen",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "James",
    "av": "Nathan",
    "topic": "COMMUNION SUNDAY/ LABOR DAY WEEKEND/ SENIOR CITIZEN DAY - COMMUNION SERIES 1",
    "title": "The Passover",
    "scripture": "Exodus 12:7-13, Luke 22:1, Luke 22:8-22",
    "objective": "To trace back how and when Passover began, connecting it to the Lord's Supper.",
    "summary": "Passover was established by God, commemorating the exodus of the Jews from slavery in Egypt. It is also significant in the redemptive work of Jesus Christ, liberating mankind from the bondage and oppressions of sin and evil.",
    "speaker": "RENE NEPOMUCENO"
  },
  {
    "date": "September 10",
    "dateTemporal": "2023-09-10",
    "lead": "Joi",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "John",
    "drums": "James",
    "backup": "Frances",
    "av": "John/Nathan",
    "topic": "COMMUNION SERIES 2",
    "title": "The Blood of Jesus",
    "scripture": "Hebrews 9:1-28, Revelation 1:5, Isaiah 1:18, Hebrews 9:12, Ephesians 1:11, Leviticus 17:11 ",
    "objective": "To give a clearer and better understanding of the wonder working power in the blood of Jesus.",
    "summary": "The Blood of Jesus is seldom spoken of in many churches of today. But for 2000 years the Gospel of Jesus Christ has never changed. We are saved by faith and that faith should be in His redemption work on Calvary and the Blood that He shed.",
    "speaker": "RAPHAEL LEVI ARNAN"
  },
  {
    "date": "September 17",
    "dateTemporal": "2023-09-17",
    "lead": "James",
    "guitar": "Nathan",
    "keys": "Noreen",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "COMMUNION SERIES 3",
    "title": "The Body of Christ",
    "scripture": "2 Corinthians 11:23-29, Matthew 26:26-28, 1 Corinthians 11:23-30, Luke 22:17-20",
    "objective": "A communion message reflecting on Jesus' command to share the cup and break the bread in remembrance of Him (focusing on the body of Christ).",
    "summary": "Everything that God has done, and possibly could do, to make us worthy is symbolised in this spiritual act. When we come together to observe the Lord’s Supper, or Communion, we must, first of all, take the Bread into our hands. In a spiritual sense, this is where our observance must begin also. We cannot partake of the sacrifice that Jesus made for us unless we first receive Him into our heart.",
    "speaker": "LARRY PABIONA"
  },
  {
    "date": "September 24",
    "dateTemporal": "2023-09-24",
    "lead": "Nathan",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "John",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "John/Nathan",
    "topic": "POST-SERVICE LEADERS’ QUARTERLY REPORT\nCOMMUNION SERIES 4",
    "title": "The Breaking of Bread",
    "scripture": "Job 10:1, John 14:6, John 20:19, John 8:1-32, Luke 24, Luke 24:13-35",
    "objective": "To show how breaking of bread leads to joy.",
    "summary": "Luke 24 is one of the most beloved accounts of the resurrection of Jesus. Follow these two disciples as they leave Jerusalem heading for home, and walk with them as they entertain an unusual stronger who caused their hearts to burn with revival fires."
  },
  {
    "date": "October 1",
    "dateTemporal": "2023-10-01",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "Nathan",
    "topic": "COMMUNION SUNDAY",
    "title": "Spiritual Warfare",
    "scripture": "Ephesians 6:10-19",
    "objective": "To emphasize that every believer should know that they were born again into a battlefield. In order to successfully live as a believer we need to know our enemies and understand how battles are won for God’s kingdom.",
    "summary": "This is a subject many Christians would rather avoid. Our victory exists in only one place and that's the realm of the Spirit. aithfulness to the Word of God and obedience to the Holy Spirit will lead us to Spiritual Victory.",
    "speaker": "STRING LA GUARDIA"
  },
  {
    "date": "October 8",
    "dateTemporal": "2023-10-08",
    "lead": "John",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "John",
    "topic": "THANKSGIVING SUNDAY",
    "title": "Where are the Nine?",
    "scripture": "Luke 17:11-19",
    "objective": "To emphasize that It is possible to receive God’s great gifts with an ungrateful heart. To draw people into a giving back relationship with the Lord and those around us.",
    "summary": "So many times in life we take advantage of the Lords blessings, and we forget to thank Him for what He has done. One of the reasons we have a hard time being thankful is that we are focused on our own needs.\n",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "October 15",
    "dateTemporal": "2023-10-15",
    "lead": "Pre-teens",
    "guitar": "Pre-teens",
    "keys": "Pre-teens",
    "bass": "Pre-teens",
    "drums": "Pre-teens",
    "backup": "Pre-teens",
    "av": "John/Nathan",
    "topic": "FCC RETREAT - PRAYER",
    "title": "Dangerous Prayers",
    "scripture": "Matthew 7:7-8,   John 17:13-19,  Genesis 32:22-32, Romans 12:1-2",
    "objective": "To develop a lifestyle of prayer as an individual and as a church family.",
    "summary": "The retreat will cover the four different types of prayers: Use Me, Search Me, Break Me, and Send Me.",
    "speaker": "VARIOUS SPEAKERS - ISAAC MELIS ON SUNDAY"
  },
  {
    "date": "October 22",
    "dateTemporal": "2023-10-22",
    "lead": "Joi",
    "guitar": "John",
    "keys": "Joi",
    "bass": "Nathan",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "PRAYER SERIES 1",
    "title": "Prayer and Fasting",
    "scripture": "Matthew 6:16-18, Acts 14:21-28, 1 Samuel 1:1-11, Psalms 112:2-111:12",
    "objective": "To emphasize the importance of authentic prayer and fasting in growing in relationship with God\n\n",
    "summary": "The first key to revival is making the commitment to pray and fast. These two spiritual disciplines are a powerful link to revival. Godly prayer with fasting releases breakthrough spiritual power.",
    "speaker": "FERDINAND FERNANDO"
  },
  {
    "date": "October 29",
    "dateTemporal": "2023-10-29",
    "lead": "John",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "Nathan",
    "topic": "PRAYER CONCERT SERVICE",
    "title": "Revive and Rejuvinate!",
    "scripture": "2 Chronicles 7:14, Colossians 4:2-6, Psalms 85:1-13, Matthew 7:7-8",
    "objective": "To pray for revival in us, in our family, in our church, and in our land.",
    "speaker": "VARIOUS SPEAKERS"
  },
  {
    "date": "November 5",
    "dateTemporal": "2023-11-05",
    "lead": "FCC Women",
    "guitar": "FCC Women",
    "keys": "FCC Women",
    "bass": "FCC Women",
    "drums": "FCC Women",
    "backup": "FCC Women",
    "av": "John/Nathan",
    "topic": "DST ENDS/ COMMUNION SUNDAY/ ALLIANCE MISSION SUNDAY",
    "title": "Prayer and Intercession",
    "scripture": "Ephesians 1:3, Philippians 4:6, Romans 8, Romans 8:26, Romans 8:26-28, Romans 8:28",
    "objective": "To define the purpose of intercessory pray, and how it brings God’s will to pass.",
    "summary": "When we are sensitive to the Holy Spirit and intercede with Him, He will lead us to intercede according to the will of God, and direct us to pray God’s will into existence. We can’t do this on our own, we need His help. We have to tune in and be sensitive to the leading of the Holy Spirit in order to accomplish this.",
    "speaker": "BENJAMIN PANTOJA"
  },
  {
    "date": "November 12",
    "dateTemporal": "2023-11-12",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "James",
    "backup": "Ymuz",
    "av": "John",
    "topic": "REMEMBRANCE SUNDAY\nPRAYER SERIES 2",
    "title": "Prayers in the Bible",
    "scripture": "2 Samuel 12:15-23; Psalm 51, 1 Kings 19:1-18, Habakkuk 3:1-21, Daniel 9:3-19",
    "objective": "To show examples of prayers in the bible and what we can learn from them.",
    "summary": "The prayers of David, Elijah, Habakkuk, Daniel, Nehemiah, etc are great models of prayers for us to emulate.  Our life with God is shaped by the way we pray. Prayer is an expression of faith in God's power, fueled by a desire for more of him.",
    "speaker": "ERWIN AMADOR"
  },
  {
    "date": "November 19",
    "dateTemporal": "2023-11-19",
    "lead": "FCC Men",
    "guitar": "FCC Men",
    "keys": "FCC Men",
    "bass": "FCC Men",
    "drums": "FCC Men",
    "backup": "FCC Men",
    "av": "John/Nathan",
    "topic": "PRAYER SERIES 3",
    "title": "Prayer and the Church",
    "scripture": "Matthew 18:19, Matthew 18:19-20, Proverbs 18:10, Romans 15:30, Acts 1:14, Ephesians 6:12",
    "objective": "This sermon defines the requirements and results of corporate prayer in the local church (includng prayer meeting).",
    "summary": "Each of us is burdened for the Lord to have His way with us as individuals while having His way with us as a church (i.e., a corporate body of believers). As members of the body of Christ, we are not only to meet together to hear and study the Word, but we are also to pray together. ",
    "speaker": "STEVE MIRPURI"
  },
  {
    "date": "November 26",
    "dateTemporal": "2023-11-26",
    "lead": "James",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Frances",
    "av": "Nathan",
    "topic": "PRAYER SERIES 4",
    "title": "Prayer and Missions",
    "scripture": "Colossians 4:2-6, Acts 12:24-13:3, Romans 10:13-14",
    "objective": "What can we do for ourselves, others in our church, and those who are serving the Lord overseas on Missions? One thing for certain is we can PRAY. This sermon teaches us specifically what we can pray . When was the last time you prayed for missions?",
    "summary": "Prayer has a great deal to do with missions. Prayer is the hand-maid of missions. The success of all real missionary effort is dependent on prayer. Prayer creates and makes missions successful, while missions lean heavily on prayer.",
    "speaker": "RAPHAEL LEVI ARNAN"
  },
  {
    "date": "December 3",
    "dateTemporal": "2023-12-03",
    "lead": "John",
    "guitar": "John",
    "keys": "Sarah",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Raquel",
    "av": "John",
    "topic": "COMMUNION SUNDAY/ ADVENT 1'",
    "title": "The History of Christmas",
    "scripture": "2 Corinthians 8:9, James 1:17, \n1 John 1:1-4, Luke 2:8-12 ",
    "objective": "To emphasize that doctrine of Christmas is that God became historical. The manger, the resurrection, the story of Jesus is not just a story. It's true. It actually happened in history.",
    "summary": "God had been giving good things to man all through history, but Christmas becomes the greatest day in history for giving, for on that day God presented to the world His greatest gift.",
    "speaker": "STRING LA GUARDIA"
  },
  {
    "date": "December 10",
    "dateTemporal": "2023-12-10",
    "lead": "Joi",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John",
    "topic": "ADVENT 2\nHUMAN RIGHTS SUNDAY",
    "title": "The Relevance of Christmas",
    "scripture": "John 1:1-14, Luke 2:8-14",
    "objective": "A closer look at the true meaning of Christmas and its implications for our lives. Is Christmas still relevant today or is it just a tradition?",
    "summary": "The significance  and relevance of Christmas is that a Saviour is born to save the world from sin and as a result God established His Kingdom on earth.  We all know that know that Christmas originated as a religious holiday. But the question arises: is religion still driving Christmas today?",
    "speaker": "LARRY PABIONA"
  },
  {
    "date": "December 17",
    "dateTemporal": "2023-12-17",
    "lead": "Nathan",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "James",
    "backup": "Joi",
    "av": "John/Nathan",
    "topic": "ADVENT 3/ CHRISTMAS SERVICE",
    "title": "The Blessing of Christmas",
    "scripture": "Luke 2:10-14, Luke 1:26-48",
    "objective": "To answer the questions:  Why is Christmas a blessing to the world and a blessed time of the year? How are we blessed? What do we have to do to receive and experience this blessing?",
    "summary": "Christmas is a celebration and thanksgiving of God giving us the very best gift we could ever have: the potential for a relationship with Him. But all too often we miss that gift and we miss the simple blessing of Christmas: knowing and treasuring Jesus in your heart.",
    "speaker": "JERRY LALIC"
  },
  {
    "date": "December 24",
    "dateTemporal": "2023-12-24",
    "lead": "Raquel",
    "guitar": "John",
    "keys": "Nathan",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Ymuz",
    "av": "John/Nathan",
    "topic": "ADVENT 4\nCHRISTMAS EVE SERVICE",
    "title": "The Impact of Christmas",
    "scripture": "Acts 1:6-9,  1:8, Galatians 5:22-23, John 13:35, 14:15-17, 16:7,  3:16, Luke 11:13,  1:34,  1:35, Matthew 2:1-12, 3:11, Romans 5:5, 8:6",
    "objective": "To  look at how Christmas impacts our future through the power and presence of the Holy Spirit. What is so very special about Christmas? What is it about Christmas that seems to bring about such a transformation in our communities, our homes, & even in the lives of so many people?",
    "summary": "For Christians, this holiday is significant because it celebrates God becoming man in order to save mankind from its sin through the birth of Jesus Christ. Christmas is observed by billions of people around the world. For two millennia, people around the world have been observing it with traditions and practices that are both religious and secular in nature."
  },
  {
    "date": "December 31",
    "dateTemporal": "2023-12-31",
    "lead": "James",
    "guitar": "Nathan",
    "keys": "Joi",
    "bass": "Ian",
    "drums": "Miguel",
    "backup": "Raquel",
    "av": "John",
    "topic": "NEW YEAR SERVICE/ POST-SERVICE LEADERS’ END-OF-YEAR REPORT",
    "objective": "To introduce our theme for year 2024",
    "speaker": "ROLAND YUMUL"
  }
]
